Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To use translations inside your Lit components, update your code as follows.
ja_jp: Lit コンポーネント内で翻訳を使用するには、次のようにコードを更新します。

source: To use virtual threads in your gRPC service implementation, check the dedicated xref:./grpc-virtual-threads.adoc[guide].
ja_jp: gRPCサービスの実装で仮想スレッドを使用するには、専用の xref:./grpc-virtual-threads.adoc[ガイド] を参照してください。

source: To verify passwords during authentication, the framework automatically uses `BcryptUtil.matches(plainPassword, hashedPassword)`.
ja_jp: 認証時にパスワードを検証するために、フレームワークは `BcryptUtil.matches(plainPassword, hashedPassword)` を自動的に使用します。

source: To verify the `quarkus-security-jpa-reactive` extension, check for the following configuration:
ja_jp: `quarkus-security-jpa-reactive` エクステンションを確認するには、次の設定を確認します。

source: To verify the `quarkus-security-jpa` extension, check for the following configuration:
ja_jp: `quarkus-security-jpa` エクステンションを確認するには、以下の設定を確認します。

source: To verify the non adult case, send another request with the age set to less than 18
ja_jp: 未成年のケースを確認するには、年齢を18歳未満に設定して別のリクエストを送信してください。

source: To verify the non-adult case, send another request with the age set to less than 18
ja_jp: 未成年のケースを確認するには、年齢を18歳未満に設定して別のリクエストを送信してください。

source: To verify your setup, that you have the AWS CLI installed, executed aws configure for the AWS access keys, and set up the `LAMBDA_ROLE_ARN` environment variable (as described above), please execute `manage.sh` without any parameters. A usage statement will be printed to guide you accordingly.
ja_jp: AWS CLIがインストールされていること、AWSアクセスキーのためのaws configureを実行していること、 `LAMBDA_ROLE_ARN` 環境変数を設定していること(上記の通り)を確認するには、 `manage.sh` をパラメーターなしで実行してください。それに応じて利用方法のガイドが表示されます。

source: To verify your setup, that you have the AWS CLI installed, executed aws configure for the AWS access keys, and setup the `LAMBDA_ROLE_ARN` environment variable (as described above), please execute `manage.sh` without any parameters. A usage statement will be printed to guide you accordingly.
ja_jp: AWS CLIがインストールされていること、AWSアクセスキーのためのaws configureを実行していること、 `LAMBDA_ROLE_ARN` 環境変数を設定していること(上記の通り)を確認するには、 `manage.sh` をパラメーターなしで実行してください。それに応じて利用方法のガイドが表示されます。

source: To view Quarkus events in tabular style, select the Event Browser on the left side of JMC, then open the Quarkus event type tree on the right side of JMC.
ja_jp: Quarkus イベントを表形式で表示するには、JMC の左側にある Event Browser を選択し、JMC の右側にある Quarkus イベントタイプツリーを開きます。

source: To view metrics, execute `curl localhost:8080/q/metrics/`
ja_jp: メトリクスを表示するには、 `curl localhost:8080/q/metrics/` を実行します。

source: To view the registered Quarkus CPE names in the US NVD, use the following search URL:
ja_jp: 米国NVDに登録されているQuarkus CPE名を閲覧するには、以下の検索URLをご利用ください:

source: To visually see the chunks in the response, we append a separator
ja_jp: レスポンス内のチャンクを視覚的に確認するために、セパレーターを追加します。

source: To wait for a specific log message, add a label with the prefix `io.quarkus.devservices.compose.wait_for.logs` to your service:
ja_jp: 特定のログメッセージを待機するには、 `io.quarkus.devservices.compose.wait_for.logs` というプレフィックスを持つラベルをサービスに追加します:

source: To walk through how to configure Basic authentication together with JPA for storing user credentials in a database, see the xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication] tutorial.
ja_jp: `JPA` を使用したBasic認証設定のウォークスルーについては、xref:security-basic-authentication-tutorial.adoc[Basic認証を用いたQuarkusアプリケーションの保護] チュートリアルを参照してください。

source: To work around the current known issue of link:https://issues.redhat.com/browse/AG-209[Agroal having a different view on running transaction checks], set the datasource transaction type for the datasource responsible for writing the transaction logs to `disabled`:
ja_jp: link:https://issues.redhat.com/browse/AG-209[トランザクションチェックを実行する際に Agroal が異なるビューを持つ] という現在の既知の問題を回避するには、トランザク ションログの書き込みを担当するデータソースのトランザクションタイプを `disabled` に設定します：

source: To work around this issue, you can set `quarkus.oidc.token-state-manager.split-tokens=true` to create a unique session token for each token. An alternative solution is to have the tokens saved in the database. For more information, see <<db-token-state-manager>>.
ja_jp: この問題を回避するには、`quarkus.oidc.token-state-manager.split-tokens=true` を設定して、トークンごとに一意のセッショントークンを作成できます。 もう 1 つの解決策は、トークンをデータベースに保存することです。 詳細は、<<db-token-state-manager>> を参照してください。

source: To work around this limitation, you can disable sending log message parameters via `logging-gelf` by configuring `quarkus.log.handler.gelf.include-log-message-parameters=false`, or you can configure your Elasticsearch index to store those fields as text or keyword, Elasticsearch will then automatically make the translation from int/boolean to a String.
ja_jp: この制限を回避するには、 `quarkus.log.handler.gelf.include-log-message-parameters=false` を設定して `logging-gelf` を介したログメッセージパラメータの送信を無効にするか、Elasticsearch インデックスにテキストまたはキーワードとしてこれらのフィールドを保存するように設定して、Elasticsearch は int/boolean から String への変換を自動的に行います。

source: To write Funqy HTTP functions, simply include the `quarkus-funqy-http` dependency into your Quarkus `pom.xml` file:
ja_jp: Funqy HTTP Function を書くには、 `quarkus-funqy-http` 依存関係をQuarkus `pom.xml` ファイルにインクルードするだけでよいです。

source: To write duration values, use the standard `java.time.Duration` format. See the link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() javadoc] for more information.
ja_jp: 期間の値を書くには、標準の `java.time.Duration` フォーマットを使います。 詳細は link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() javadoc] を参照してください。

source: To write duration values, use the standard `java.time.Duration` format. See the link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() Java API documentation] for more information.
ja_jp: 期間の値を書くには、標準の `java.time.Duration` フォーマットを使います。 詳細は link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() Java API documentation] を参照してください。

source: To write duration values, use the standard `java.time.Duration` format. See the link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() javadoc] for more information.
ja_jp: 期間の値を書くには、標準の `java.time.Duration` フォーマットを使います。 詳細は link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/time/Duration.html#parse(java.lang.CharSequence)[Duration#parse() javadoc] を参照してください。

source: To write the integration test, use the following code sample:
ja_jp: 統合テストを書くには、次のコードサンプルを使用します:

source: To write your outgoing messages as Cloud Event, you only need to specify the `cloud-events-type` and `cloud-events-source` attributes on your channel:
ja_jp: 送信メッセージをクラウドイベントとして記述するには、チャンネルに `cloud-events-type` と `cloud-events-source` 属性を指定するだけです。

source: To xref:jwt-parser[parse and verify JsonWebToken with JWTParser], use `smallrye-jwt` instead of `quarkus-smallrye-jwt` directly for the following situations:
ja_jp: xref:jwt-parser[JWTParserでJsonWebTokenを解析・検証] するには、以下のような状況では、 `quarkus-smallrye-jwt` の代わりに `smallrye-jwt` を直接使用します:

source: To...
ja_jp: 以下の場合

source: Today we announce the availability of Quarkus 2.2.1.Final, which is the result of our first hardening cycle.
ja_jp: 本日、Quarkus 2.2.1.Finalがリリースされました。これは最初のハードニングサイクルの成果です。

source: Today we're proud to announce link:https://github.com/quarkiverse[Quarkiverse Hub], a GitHub organization where any contributor can host their Quarkus extensions.
ja_jp: 今日は、コントリビューターが誰でもQuarkusのエクステンションをホストできるGitHub Organizationである https://github.com/quarkiverse[Quarkiverse Hub]を発表します。

source: Today we're proud to announce our quarkus.io Japanese localization site (https://ja.quarkus.io[https://ja.quarkus.io]) is now open. It is where our valuable guides and blog entries are translated.
ja_jp: 本日、quarkus.io日本語版サイト (https://ja.quarkus.io[https://ja.quarkus.io]) が公開されましたことをお知らせします。ここでは、Quarkusの価値あるガイドや、ブログエントリの翻訳が公開されます。

source: Today, we announce the availability of Quarkus 1.13.0.Final.
ja_jp: 本日、Quarkus 1.13.0.Finalがリリースされました。

source: Today, we announce the availability of Quarkus 2.5.0.Final which comes with the following main improvements:
ja_jp: 本日、Quarkus 2.5.0.Finalがリリースされ、以下の点が改善されました。

source: Today, we release Quarkus 2.1.0.Final which includes a lot of refinements and improvements and a couple of new features:
ja_jp: 本日、Quarkus 2.1.0.Finalをリリースしました。多くの改良と改善、いくつかの新機能が含まれています。

source: Today, we release Quarkus 2.3.0.Final which includes a lot of refinements and improvements and some new features:
ja_jp: 本日、Quarkus 2.3.0.Finalをリリースしました。多くの改良と改善、いくつかの新機能が含まれています。

source: Today, we release Quarkus 2.4.0.Final which includes a lot of refinements and improvements and some new features:
ja_jp: 本日、Quarkus 2.4.0.Finalをリリースしました。多くの改良と改善、いくつかの新機能が含まれています。

source: Today, we released 2.7.5.Final which, as usual, only contains bugfixes and documentation improvements.
ja_jp: 本日、2.7.5.Finalをリリースしましたが、例によってバグフィックスとドキュメントの改善のみが含まれています。

source: Today, we released 2.8.1.Final which, as usual, only contains bugfixes and documentation improvements.
ja_jp: 本日、2.8.1.Finalをリリースしましたが、例によってバグフィックスとドキュメントの改善のみが含まれています。

source: Today, we released 2.8.2.Final which, as usual, only contains bugfixes and documentation improvements.
ja_jp: 本日、2.8.2.Finalをリリースしましたが、例によってバグフィックスとドキュメントの改善のみが含まれています。

source: Today, we released Quarkus 1.8.1.Final with some bugfixes and documentation improvements.
ja_jp: 本日、Quarkus 1.8.1.Finalをリリースし、いくつかのバグフィックスとドキュメントの改善を行いました。

source: Today, we released Quarkus 1.8.2.Final with some bugfixes and documentation improvements.
ja_jp: 本日、Quarkus 1.8.2.Finalをリリースし、いくつかのバグフィックスとドキュメントの改善を行いました。

source: Today, we released Quarkus 1.8.3.Final which contains a fix for an annoying regression and some other fixes.
ja_jp: 本日、Quarkus 1.8.3.Finalをリリースしました。このリリースには、迷惑なリグレッションの修正やその他いくつかの修正が含まれています。

source: Today, we released Quarkus 2.12.0.Final with GraalVM/Mandrel 22.2, Kotlin 1.7 and more.
ja_jp: 本日、GraalVM/Mandrel 22.2、Kotlin 1.7などを搭載したQuarkus 2.12.0.Finalをリリースしました。

source: Today, we released Quarkus 2.14.0.Final with a lot of new features and small improvements all over the place:
ja_jp: 本日、多くの新機能と小さな改善を随所に盛り込んだQuarkus 2.14.0.Finalをリリースしました。

source: Today, we released Quarkus 2.2.2.Final, a maintenance release for our 2.2 release train containing bugfixes and documentation improvements.
ja_jp: 本日、Quarkus 2.2.2.Finalをリリースしました。このリリースは、2.2リリーストレインのメンテナンスリリースで、バグフィックスとドキュメントの改善を含んでいます。

source: Today, we released Quarkus 2.2.3.Final, a maintenance release for our 2.2 release train containing a few bugfixes and platform version bumps.
ja_jp: 本日、Quarkus 2.2.3.Finalをリリースしました。これは、2.2リリーストレインのメンテナンスリリースで、いくつかのバグフィックスとプラットフォームバージョンの変更を含んでいます。

source: Today, we released Quarkus 2.3.1.Final, a maintenance release for our 2.3 release train containing bugfixes and documentation improvements.
ja_jp: 本日、Quarkus 2.3.1.Finalをリリースしました。このリリースは、2.3リリーストレインのメンテナンスリリースで、バグフィックスとドキュメントの改善を含んでいます。

source: Today, we released Quarkus 2.4.2.Final, a maintenance release for our 2.4 release train containing bugfixes and documentation improvements.
ja_jp: 本日、Quarkus 2.4.2.Finalをリリースしました。このリリースは、2.4リリーストレインのメンテナンスリリースで、バグフィックスとドキュメントの改善を含んでいます。

source: Today, we released Quarkus 2.5.1.Final, a maintenance release for our 2.5 release train containing bugfixes and documentation improvements.
ja_jp: 本日、Quarkus 2.5.1.Finalをリリースしました。このリリースは、2.5リリーストレインのメンテナンスリリースで、バグフィックスとドキュメントの改善を含んでいます。

source: Today, we released Quarkus 2.7.1.Final, our first maintenance release for our 2.7 release train. It contains bugfixes and documentation improvements, but also a couple of new features, filling a few gaps.
ja_jp: 本日、Quarkus 2.7.1.Finalをリリースしました。これは、2.7リリーストレインの最初のメンテナンスリリースです。このリリースには、バグフィックスとドキュメントの改善が含まれていますが、いくつかの新機能も含まれており、いくつかのギャップを埋めるものとなっています。

source: Today, we released Quarkus 2.9.2.Final, our second maintenance release for 2.9. It comes with a bunch of fixes and documentation improvements.
ja_jp: 本日、2.9の2回目のメンテナンスリリースであるQuarkus 2.9.2.Finalをリリースしました。 これには、多数の修正とドキュメントの改善が含まれます。

source: Today, we released Quarkus 3.0.0.CR1, bringing us one step closer to Quarkus 3.0 final release.
ja_jp: 本日、Quarkus 3.0.0.CR1をリリースしました。Quarkus 3.0の最終リリースに一歩近づいたと言えます。

source: Today, we released Quarkus 3.20.5, our next maintenance release for the 3.20 LTS stream.
ja_jp: 本日、Quarkus 3.20.5 をリリースしました。これは 3.20 LTS ストリームの次期メンテナンスリリースです。

source: Today, we released Quarkus 3.20.6, our next maintenance release for the 3.20 LTS stream.
ja_jp: 本日、Quarkus 3.20.6 をリリースしました。これは 3.20 LTS ストリームの次期メンテナンスリリースです。

source: Today, we released Quarkus 3.27.2, our next maintenance release for the 3.27 LTS stream.
ja_jp: 本日、Quarkus 3.27.2 をリリースしました。これは 3.27 LTS ストリームの次のメンテナンスリリースです。

source: Today, we released Quarkus 3.27.3, our next maintenance release for the 3.27 LTS stream.
ja_jp: 本日、Quarkus 3.27.3 をリリースしました。これは 3.27 LTS ストリームの次のメンテナンスリリースです。

source: Today, we released Quarkus 3.30.6, a new maintenance release for our 3.30 stream, and our first release for 2026.
ja_jp: 本日、Quarkus 3.30 ストリームの新しいメンテナンスリリースである Quarkus 3.30.6 をリリースしました。これは、2026 年最初のリリースとなります。

source: Today, we released Quarkus 3.30.7, a new maintenance release for our 3.30 stream, containing a couple additional fixes and a Vert.x micro update.
ja_jp: 本日、Quarkus 3.30.7 をリリースしました。これは 3.30 ストリームの新しいメンテナンスリリースで、いくつかの追加修正と Vert.x のマイクロアップデートが含まれています。

source: Today, we released Quarkus 3.30.8, a new maintenance release for our 3.30 stream.
ja_jp: 本日、Quarkus 3.30 ストリームの新しいメンテナンスリリースである Quarkus 3.30.8 をリリースしました。

source: Today, we released Quarkus 3.31.2, the first maintenance release for our 3.31 stream (we skipped 3.31.0).
ja_jp: 本日、3.31 ストリームで最初のメンテナンスリリースである Quarkus 3.31.2 をリリースしました (3.31.0 はスキップしました)。

source: Today, we released Quarkus 3.31.3, the second maintenance release for our 3.31 stream (we skipped 3.31.0).
ja_jp: 本日、Quarkus 3.31ストリームの2番目のメンテナンスリリースである Quarkus 3.31.3 をリリースしました (3.31.0 はスキップしました)。

source: Today, we released Quarkus 3.31.4, the third maintenance release for our 3.31 stream (we skipped 3.31.0).
ja_jp: 本日、3.31 ストリーム向けの3回目のメンテナンスリリースである Quarkus 3.31.4 をリリースしました (3.31.0 はスキップしました)。

source: Today, we released Quarkus 3.32.2, the first maintenance release for our 3.32 stream (we skipped 3.32.0).
ja_jp: 本日、Quarkus 3.32.2 をリリースしました。これは、3.32 ストリームにとって最初のメンテナンスリリースです (3.32.0 はスキップしました)。

source: Today, we released Quarkus 3.32.3, the second maintenance release for our 3.32 stream (we skipped 3.32.0).
ja_jp: 本日、Quarkus 3.32.3 をリリースしました。これは 3.32 ストリーム向けの 2 番目のメンテナンスリリースです (3.32.0 はスキップしました)。

source: Today, we released Quarkus 3.34.2, the first maintenance release for our 3.34 stream (we skipped 3.34.0).
ja_jp: 本日、Quarkus 3.34.2 をリリースしました。これは、3.34 ストリーム初のメンテナンスリリースです (3.34.0 はスキップされました)。

source: Today, we released Quarkus 3.34.3, the second maintenance release for our 3.34 stream (we skipped 3.34.0).
ja_jp: 本日、3.34ストリーム向けの2番目のメンテナンスリリースである Quarkus 3.34.3 をリリースしました (3.34.0はスキップしました)。

source: Today, we released Quarkus 3.4.2, our first maintenance release for our 3.4 release train (we skipped 3.4.0).
ja_jp: 本日、Quarkus 3.4.2をリリースしました。3.4リリーストレインの最初のメンテナンスリリースです（3.4.0はスキップしました）。

source: Today, we released a new maintenance release for our 2.7 release train: 2.7.3.Final.
ja_jp: 本日、2.7リリーストレインの新しいメンテナンスリリース：2.7.3.Finalをリリースしました。

source: Today, we released both Quarkus 2.11.1.Final and Quarkus 2.10.4.Final. Quarkus 2.11.1.Final is, despite its name, the first 2.11 release.
ja_jp: 本日、Quarkus 2.11.1.FinalとQuarkus 2.10.4.Finalの両方がリリースされました。Quarkus 2.11.1.Finalは、その名前に反して、最初の2.11リリースです。

source: Today, we released both https://quarkus.io/blog/quarkus-3-33-released/[Quarkus 3.33 LTS] and Quarkus 3.34.
ja_jp: 本日、 https://quarkus.io/blog/quarkus-3-33-released/[Quarkus 3.33 LTS] と Quarkus 3.34 の両方をリリースしました。

source: Today’s users embrace applications with milliseconds of response time, 100% uptime, lower latency, push data instead of pull, higher throughput, and elasticity. However, these features are nearly impossible to achieve using yesterday’s software architecture without a considerable investment in resources, infrastructure, and tooling. The world changed, and having dozens of servers, long response times (&gt; 500 ms), downtime due to maintenance or waterfalls of failures does not meet the expected user experience.
ja_jp: 今日のユーザーは、ミリ秒単位の応答時間、100%のアップタイム、低レイテンシー、プル型ではなくプッシュ型データ、高いスループット、そして弾力性を備えたアプリケーションを受け入れています。しかし、これらの機能は、リソース、インフラ、ツールに多大な投資をしない限り、昨日のソフトウェアアーキテクチャで実現することはほぼ不可能です。世界は変わり、何十台ものサーバー、長い応答時間（500ms以上）、メンテナンスによるダウンタイム、滝のような障害などは、期待されるユーザーエクスペリエンスを満たすものではありません。

source: Together with Georgios, we decided to experiment with rewriting the bytecode of some of these libraries at build time to remove the reflective calls and replace them with direct invocations, when the application was targeting a Java version that supports the feature.
ja_jp: Georgios とともに、アプリケーションが特定の機能をサポートする Java バージョンをターゲットにしている場合に、これらのライブラリーの一部のバイトコードをビルド時に書き換え、リフレクション呼び出しを削除して直接呼び出しに置き換える実験を行うことにしました。

source: Together with the SmallRye Health extension, Quarkus Messaging extensions provide health check support per channel. The implementation of _startup_, _readiness_ and _liveness_ checks depends on the connector. Some connectors allow configuring the health check behavior or disabling them completely or per channel.
ja_jp: Quarkus Messaging エクステンションは、SmallRye Health エクステンションと組み合わせることで、チャネルごとにヘルスチェックのサポートを提供します。 _startup_、_readiness_、および _liveness_ チェックの実装はコネクターによって異なります。 一部のコネクターでは、ヘルスチェックの動作を設定したり、完全にまたはチャネルごとに無効にしたりできます。

source: Together, these JEPs make Project Leyden fully usable starting with OpenJDK 25.
ja_jp: これらの JEP が連携することで、OpenJDK 25 から Project Leyden を完全に利用できるようになります。

source: Together, these settings will ensure that the application can very quickly reconnect to the broker after being restarted in dev mode.
ja_jp: これらの設定を併用することで、アプリケーションをDevモードで再起動した後に、非常に迅速にブローカに再接続できるようになります。

source: Token Claims And SecurityIdentity Roles
ja_jp: トークンクレームとセキュリティーアイデンティティロール

source: Token Decryption
ja_jp: トークン復号化

source: Token Endpoint Configuration
ja_jp: トークンエンドポイントの設定

source: Token Introspection and UserInfo Cache
ja_jp: トークンイントロスペクションと UserInfo キャッシュ

source: Token JWK verification keys are resolved at the application start-up by default and perodically refreshed when no matching key is available to verify the current token.
ja_jp: トークンの JWK 検証鍵は、デフォルトでアプリケーションの起動時に解決され、現在のトークンを検証するために一致する鍵が利用できない場合に定期的にリフレッシュされます。

source: Token Propagation
ja_jp: トークンの伝播

source: Token Propagation Reactive
ja_jp: トークン伝播リアクティブ

source: Token Propagation for Quarkus REST
ja_jp: Quarkus REST のトークン伝播

source: Token Propagation for RESTEasy Classic
ja_jp: RESTEasy Classic のトークン伝播

source: Token Verification And Introspection
ja_jp: トークンの検証とイントロスペクション

source: Token age
ja_jp: トークンの有効期間

source: Token audience used to set an `aud` (audience) claim value if this claim has not already been set.
ja_jp: このクレームがまだ設定されていない場合に、 `aud` (オーディエンス) クレーム値を設定するために使用されるトークンオーディエンス。

source: Token audience which can be used to set an `aud` (audience) claim value if this claim has not already been set.
ja_jp: `aud` (オーディエンス) クレームがまだ設定されていない場合に、このクレーム値を設定するために使用できるトークンオーディエンス。

source: Token authentication mechanism comparison
ja_jp: トークン認証メカニズムの比較

source: Token authorization
ja_jp: トークンの認可

source: Token authorization scheme
ja_jp: トークン認証スキーム

source: Token binding
ja_jp: トークンバインディング

source: Token bindings are tools for sender-constraining access tokens.
ja_jp: トークンバインディングは、アクセストークンを送信者に制限するためのツールです。

source: Token claims
ja_jp: トークンクレーム

source: Token claims and SecurityIdentity roles
ja_jp: トークンクレームと SecurityIdentity ロール

source: Token claims properties
ja_jp: トークンクレームプロパティー

source: Token decryption
ja_jp: トークン復号化

source: Token endpoint configuration
ja_jp: トークンのエンドポイント設定

source: Token header
ja_jp: トークンヘッダー

source: Token header customizer
ja_jp: トークンヘッダーのカスタマイザー

source: Token introspection
ja_jp: トークンイントロスペクション

source: Token introspection and UserInfo cache
ja_jp: トークンのイントロスペクションと UserInfo のキャッシュ

source: Token introspection and `UserInfo` cache
ja_jp: トークンのイントロスペクションと `UserInfo` キャッシュ

source: Token introspection cache
ja_jp: トークンイントロスペクションキャッシュ

source: Token introspection path
ja_jp: トークンイントロスペクションパス

source: Token introspection properties
ja_jp: トークンイントロスペクションプロパティー

source: Token issuer
ja_jp: トークン発行者

source: Token issuer used to set an `iss` (issuer) claim value if this claim has not already been set.
ja_jp: このクレームがまだ設定されていない場合に、 `iss` (発行者) クレーム値を設定するために使用されるトークン発行者。

source: Token issuer which can be used to set an `iss` (issuer) claim value if this claim has not already been set.
ja_jp: `iss` (発行者)クレームがまだ設定されていない場合に、このクレーム値を設定するために使用できるトークン発行者。

source: Token lifespan in seconds used to calculate an `exp` (expiry) claim value if this claim has not already been set.
ja_jp: このクレームがまだ設定されていない場合に、 `exp` (有効期限) クレーム値を計算するために使用されるトークンの有効期間 (秒単位)。

source: Token lifespan in seconds which will be used to calculate an `exp` (expiry) claim value if this claim has not already been set.
ja_jp: exp (expiry) クレームがまだ設定されていない場合、このクレーム値を計算するために使用される トークン生存期間の秒数。

source: Token path
ja_jp: トークンパス

source: Token preprocessing
ja_jp: トークンの前処理

source: Token preprocessing properties
ja_jp: トークン前処理プロパティー

source: Token propagation
ja_jp: トークンの伝播

source: Token propagation and exchange
ja_jp: トークンの伝播と交換

source: Token properties cover a lot of requirements related to the token verification, introspection, key verification management, etc.
ja_jp: トークンプロパティーは、トークンの検証、イントロスペクション、鍵検証管理などに関連する多くの要件をカバーしています。

source: Token revocation
ja_jp: トークンの失効

source: Token revocation path
ja_jp: トークン失効パス

source: Token roles
ja_jp: トークンロール

source: Token scopes and SecurityIdentity permissions
ja_jp: トークンのスコープと SecurityIdentity の権限

source: Token type
ja_jp: トークンタイプ

source: Token validation
ja_jp: トークンのバリデーション

source: Token verification
ja_jp: トークン検証

source: Token verification and introspection
ja_jp: トークン検証およびイントロスペクション

source: Token verification claim properties impact the core token verification process, where the token claims or introspection properties must meet specific issuer, audience, age and other restrictions.
ja_jp: トークン検証のクレームプロパティーはコアなトークン検証プロセスに影響を与え、トークンクレームやイントロスペクションプロパティーが特定の発行者、オーディエンス、有効期間などの制限を満たす必要があります。

source: Token verification key refresh properties
ja_jp: トークン検証キー更新プロパティー

source: Token-based access control
ja_jp: トークンベースのアクセス制御

source: Tokens with certificate chain
ja_jp: 証明書チェーンを持つトークン

source: Tokens with certificate chains
ja_jp: 証明書チェーンを持つトークン

source: Tooling
ja_jp: ツール

source: Tools that are known to not be affected are:
ja_jp: 影響を受けないことが確認されているツールは以下の通りです：

source: Tools that at current time of writing is known to excert the problem and should NOT be used for measuring latency/throughput (it may be used for other things):
ja_jp: 現時点では、この問題を引き起こすことが知られているツールは、レイテンシ/スループットの測定には使用しないでください（他のことには使用できるかもしれません）：

source: Top-level Type-safe Templates
ja_jp: トップレベルタイプセーフテンプレート

source: Top-level checked templates
ja_jp: トップレベルチェック済テンプレート

source: Top-level type-safe templates
ja_jp: トップレベルのタイプセーフテンプレート

source: Top-level vs Multi-module project directory
ja_jp: トップレベルとマルチモジュールのプロジェクトディレクトリ

source: Topic Configuration
ja_jp: トピック構成

source: Topic auto discovery period when using a pattern for topic's consumer. The default and minimum value is 1 minute.
ja_jp: トピックの消費者にパターンを使用する場合のトピック自動検出期間。

source: Topic name
ja_jp: トピック名

source: Topic pattern
ja_jp: トピックパターン
